; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_8_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 c5 c6 c7 - counter
	)
  (:init
		(= (value c0) 27)
	(= (value c1) 53)
	(= (value c2) 98)
	(= (value c3) 86)
	(= (value c4) 65)
	(= (value c5) 77)
	(= (value c6) 57)
	(= (value c7) 52)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)
	(= (rate_value c5) 0)
	(= (rate_value c6) 0)
	(= (rate_value c7) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
	(<= (+ (value c4) 1) (value c5))
	(<= (+ (value c5) 1) (value c6))
	(<= (+ (value c6) 1) (value c7))
		)
	)
)

; plan
1. (increase_rate c6)
   changed: (rate_value c6) from 0 to 1
   goals met: 3 of 7
2. (increase_rate c7)
   changed: (rate_value c7) from 0 to 1
   goals met: 3 of 7
3. (increase_rate c6)
   changed: (rate_value c6) from 1 to 2
   goals met: 3 of 7
4. (increase_rate c6)
   changed: (rate_value c6) from 2 to 3
   goals met: 3 of 7
5. (increase_rate c4)
   changed: (rate_value c4) from 0 to 1
   goals met: 3 of 7
6. (increase_rate c4)
   changed: (rate_value c4) from 1 to 2
   goals met: 3 of 7
7. (increase_rate c4)
   changed: (rate_value c4) from 2 to 3
   goals met: 3 of 7
8. (decrement c6)
   changed: (value c6) from 57 to 54
   goals met: 3 of 7
9. (decrement c6)
   changed: (value c6) from 54 to 51
   goals met: 4 of 7
10. (increase_rate c4)
   changed: (rate_value c4) from 3 to 4
   goals met: 4 of 7
11. (increase_rate c4)
   changed: (rate_value c4) from 4 to 5
   goals met: 4 of 7
12. (increase_rate c3)
   changed: (rate_value c3) from 0 to 1
   goals met: 4 of 7
13. (increase_rate c3)
   changed: (rate_value c3) from 1 to 2
   goals met: 4 of 7
14. (increase_rate c4)
   changed: (rate_value c4) from 5 to 6
   goals met: 4 of 7
15. (increment c4)
   changed: (value c4) from 65 to 71
   goals met: 4 of 7
16. (increase_rate c4)
   changed: (rate_value c4) from 6 to 7
   goals met: 4 of 7
17. (increment c4)
   changed: (value c4) from 71 to 78
   goals met: 3 of 7
18. (increase_rate c2)
   changed: (rate_value c2) from 0 to 1
   goals met: 3 of 7
19. (increase_rate c2)
   changed: (rate_value c2) from 1 to 2
   goals met: 3 of 7
20. (increase_rate c3)
   changed: (rate_value c3) from 2 to 3
   goals met: 3 of 7
21. (increase_rate c3)
   changed: (rate_value c3) from 3 to 4
   goals met: 3 of 7
22. (increase_rate c6)
   changed: (rate_value c6) from 3 to 4
   goals met: 3 of 7
23. (increase_rate c6)
   changed: (rate_value c6) from 4 to 5
   goals met: 3 of 7
24. (increment c6)
   changed: (value c6) from 51 to 56
   goals met: 2 of 7
25. (increase_rate c6)
   changed: (rate_value c6) from 5 to 6
   goals met: 2 of 7
26. (increase_rate c6)
   changed: (rate_value c6) from 6 to 7
   goals met: 2 of 7
27. (increment c6)
   changed: (value c6) from 56 to 63
   goals met: 2 of 7
28. (increase_rate c6)
   changed: (rate_value c6) from 7 to 8
   goals met: 2 of 7
29. (increment c6)
   changed: (value c6) from 63 to 71
   goals met: 2 of 7
30. (increase_rate c6)
   changed: (rate_value c6) from 8 to 9
   goals met: 2 of 7
31. (increase_rate c6)
   changed: (rate_value c6) from 9 to 10
   goals met: 2 of 7
32. (increase_rate c2)
   changed: (rate_value c2) from 2 to 3
   goals met: 2 of 7
33. (decrement c2)
   changed: (value c2) from 98 to 95
   goals met: 2 of 7
34. (decrement c2)
   changed: (value c2) from 95 to 92
   goals met: 2 of 7
35. (increment c6)
   changed: (value c6) from 71 to 81
   goals met: 3 of 7
36. (decrement_rate c7)
   changed: (rate_value c7) from 1 to 0
   goals met: 3 of 7
37. (decrement c6)
   changed: (value c6) from 81 to 71
   goals met: 2 of 7
38. (decrement c2)
   changed: (value c2) from 92 to 89
   goals met: 2 of 7
39. (decrement c2)
   changed: (value c2) from 89 to 86
   goals met: 2 of 7
40. (decrement c2)
   changed: (value c2) from 86 to 83
   goals met: 3 of 7
41. (increment c4)
   changed: (value c4) from 78 to 85
   goals met: 3 of 7
42. (increase_rate c4)
   changed: (rate_value c4) from 7 to 8
   goals met: 3 of 7
43. (increase_rate c4)
   changed: (rate_value c4) from 8 to 9
   goals met: 3 of 7
44. (decrement c3)
   changed: (value c3) from 86 to 82
   goals met: 3 of 7
45. (decrement c2)
   changed: (value c2) from 83 to 80
   goals met: 4 of 7
46. (increase_rate c7)
   changed: (rate_value c7) from 0 to 1
   goals met: 4 of 7
47. (increase_rate c7)
   changed: (rate_value c7) from 1 to 2
   goals met: 4 of 7
48. (increase_rate c7)
   changed: (rate_value c7) from 2 to 3
   goals met: 4 of 7
49. (increase_rate c7)
   changed: (rate_value c7) from 3 to 4
   goals met: 4 of 7
50. (increase_rate c7)
   changed: (rate_value c7) from 4 to 5
   goals met: 4 of 7
51. (increment c7)
   changed: (value c7) from 52 to 57
   goals met: 4 of 7
52. (increment c7)
   changed: (value c7) from 57 to 62
   goals met: 4 of 7
53. (increment c7)
   changed: (value c7) from 62 to 67
   goals met: 4 of 7
54. (increment c7)
   changed: (value c7) from 67 to 72
   goals met: 5 of 7
55. (increment c6)
   changed: (value c6) from 71 to 81
   goals met: 5 of 7
56. (increment c7)
   changed: (value c7) from 72 to 77
   goals met: 5 of 7
57. (increment c7)
   changed: (value c7) from 77 to 82
   goals met: 6 of 7
58. (decrement c4)
   changed: (value c4) from 85 to 76
   goals met: 6 of 7
59. (decrement c3)
   changed: (value c3) from 82 to 78
   goals met: 5 of 7
60. (decrement c3)
   changed: (value c3) from 78 to 74
   goals met: 6 of 7
61. (decrement c2)
   changed: (value c2) from 80 to 77
   goals met: 6 of 7
62. (decrement c2)
   changed: (value c2) from 77 to 74
   goals met: 6 of 7
63. (decrement c2)
   changed: (value c2) from 74 to 71
   goals met: 7 of 7
